backend/controllers/AnggotaKoperasiController.php

SELECT * FROM `anggota_koperasi`
---
    public function actionIndex()
    {
        $searchModel = new AnggotaKoperasiSearch();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);
        $anggota = AnggotaKoperasi::find()->all();