backend/controllers/DataBarangController.php

    public function actionIndex()
    {
        $searchModel = new DataBarangSearch();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);

        $data_barang = DataBarang::find()->all();
---
SELECT * FROM `data_barang`

    public function actionCreate()
    {
        $model = new DataBarang();

        $data_kategori = ArrayHelper::map(
            KategoriBarang::find()->all(),
            'id_kategori',
            function ($model) {
                return $model['nama_kategori'];
            }
        );

        $data_satuan = ArrayHelper::map(
            DataSatuan::find()->all(),
            'id_satuan',
            function ($model) {
                return $model['nama_satuan'];
            }
        );

        $data_supplier = ArrayHelper::map(
            AnggotaKoperasi::find()->where(['id_jenis_anggota' => 2])->all(),
            'id_anggota',
            function ($model) {
                return $model['nama_anggota'];
            }
        );
---
SELECT * FROM `kategori_barang`
SELECT * FROM `data_satuan`
SELECT * FROM `anggota_koperasi` WHERE `id_jenis_anggota`=2

    public function actionUpdate($id)
    {
        $model = $this->findModel($id);

        $data_kategori = ArrayHelper::map(
            KategoriBarang::find()->all(),
            'id_kategori',
            function ($model) {
                return $model['nama_kategori'];
            }
        );

        $data_satuan = ArrayHelper::map(
            DataSatuan::find()->all(),
            'id_satuan',
            function ($model) {
                return $model['nama_satuan'];
            }
        );

        $data_supplier = ArrayHelper::map(
            AnggotaKoperasi::find()->where(['id_jenis_anggota' => 2])->all(),
            'id_anggota',
            function ($model) {
                return $model['nama_anggota'];
            }
        );
---
SELECT * FROM `kategori_barang`
SELECT * FROM `data_satuan`
SELECT * FROM `anggota_koperasi` WHERE `id_jenis_anggota`=2