backend/controllers/KategoriBarangController.php

    public function actionCreate()
    {
        $model = new KategoriBarang();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `kategori_barang` (`nama_kategori`) VALUES ('ROKOK')