backend/controllers/MenuNavigasiController.php

    public function actionView($id)
    {
        if (Yii::$app->user->isGuest) {
            header("Location: index.php");
            exit;
        }

        $searchModel = new MenuNavigasiSubSearch();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);

        $jumlahSubmenu = MenuNavigasi::find()->where(["id_parent" => $id])->count();

        $userrole = Yii::$app->db->createCommand("SELECT system_role.nama_role FROM user_role INNER JOIN system_role ON system_role.id_system_role = user_role.id_system_role WHERE user_role.id_login = " . Yii::$app->user->id . " AND  system_role.nama_role = 'DEVELOPER'")->queryScalar();
        if ($userrole == 'DEVELOPER') {
            $hakakses = Systemrole::find()->orderBy("nama_role")->all();
        } else {
            $hakakses = Systemrole::find()->orderBy("nama_role")->where(['!=', 'nama_role', 'DEVELOPER'])->all();
        }

        if (Yii::$app->request->isPost) {
            if (is_array(Yii::$app->request->post('data'))) {
                MenuNavigasiRole::deleteAll(["id_menu" => $id]);
                //echo var_dump(Yii::$app->request->post('data'))."<br>";
                foreach (Yii::$app->request->post('data') as $key => $data) {
                    $cek = MenuNavigasiRole::find()->where(["id_system_role" => $key, "id_menu" => $id])->count();
                    if ($cek < 1) {
                        $simpan = new MenuNavigasiRole();
                        $simpan->id_system_role = $key;
                        $simpan->id_menu = $id;
                        $simpan->save(false);
---
SELECT COUNT(*) FROM `menu_navigasi` WHERE `id_parent`='97'
SELECT * FROM `system_role` ORDER BY `nama_role`
SELECT * FROM `system_role` WHERE `nama_role` != 'DEVELOPER' ORDER BY `nama_role`
DELETE FROM `menu_navigasi_role` WHERE `id_menu`='97'
SELECT COUNT(*) FROM `menu_navigasi_role` WHERE (`id_system_role`=1) AND (`id_menu`='97')
INSERT INTO `menu_navigasi_role` (`id_system_role`, `id_menu`) VALUES (1, 97)

    public function actionCreate()
    {
        if (Yii::$app->user->isGuest) {
            header("Location: index.php");
            exit();
        }

        $model = new MenuNavigasi();
        $menuParent = Arrayhelper::map(MenuNavigasi::find()
            ->where(["id_parent" => 0])
            ->orderBy("nama_menu")->all(), "id_menu", "nama_menu");

        if ($model->load(Yii::$app->request->post())) {

            if ($model->id_parent == "") $model->id_parent = "0";


            $menu = MenuNavigasi::find()->select("max(no_urut)+1 as no_urut")
                ->where(["id_parent" => $model->id_parent])->one();


            if ($menu->no_urut == "") $menu->no_urut = "1";

            $model->no_urut = $menu->no_urut;
            $model->save(false);
---
SELECT * FROM `menu_navigasi` WHERE `id_parent`=0 ORDER BY `nama_menu`
SELECT max(no_urut)+1 AS `no_urut` FROM `menu_navigasi` WHERE `id_parent`='98'
INSERT INTO `menu_navigasi` (`nama_menu`, `url`, `id_parent`, `icon`, `status`, `no_urut`) VALUES ('Data Pembelian Barang', 'data-pembelian', 98, 'money-bill-wave', 0, 1)

    public function actionUpdate($id)
    {
        if (Yii::$app->user->isGuest) {
            header("Location: index.php");
            exit();
        }

        $model = $this->findModel($id);
        $menuParent = Arrayhelper::map(MenuNavigasi::find()
            ->where(["id_parent" => 0])
            ->orderBy("nama_menu")->all(), "id_menu", "nama_menu");
---
SELECT * FROM `menu_navigasi` WHERE `id_parent`=0 ORDER BY `nama_menu`