backend/views/menu-navigasi/view.php

SELECT COUNT(*) FROM `menu_navigasi_role` WHERE (`id_system_role`=1) AND (`id_menu`=97)
---

                <?php
                foreach ($hakakses as $data) {
                    $cek = MenuNavigasiRole::find()->where(["id_system_role" => $data->id_system_role, "id_menu" => $model->id_menu])->count();