backend/views/layouts/left.php

SELECT * FROM `user_role` WHERE `id_login`=1
SELECT * FROM `system_role` WHERE `id_system_role`=1
---
					?>
				</p>
				<?php
				$userrole = Userrole::find()->where(['id_login' => Yii::$app->user->identity->id_login])->one();
				$level = Systemrole::find()->where(['id_system_role' => $userrole->id_system_role])->one();

SELECT * FROM `menu_navigasi_role` WHERE `id_system_role` IN (9, 1)
SELECT * FROM `menu_navigasi` WHERE ((`id_parent`=0) AND (`status`=0)) AND (`id_menu` IN ('1', '2', '3', '4', '94', '95', '96', '97')) ORDER BY `no_urut`
---
		use backend\models\MenuNavigasi;
		use backend\models\MenuNavigasiRole;

		$hakakses = MenuNavigasiRole::find()->where(["in", "id_system_role", Yii::$app->session->get('user_role_id')])->asArray()->all();

		$menu = MenuNavigasi::find()->where(["id_parent" => 0, "status" => 0])
			->andWhere(["in", "id_menu", $hakakses])
			->orderBy("no_urut")->all();

SELECT * FROM `menu_navigasi` WHERE ((`id_parent`=1) AND (`status`=0)) AND (`id_menu` IN ('1', '2', '3', '4', '94', '95', '96', '97')) ORDER BY `no_urut`
---
		));

		foreach ($menu as $data) {
			$menu2 = MenuNavigasi::find()->where(["id_parent" => $data->id_menu, "status" => 0])
				->andWhere(["in", "id_menu", $hakakses])
				->orderBy("no_urut")->all();